<center>
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/images/SN_web_lightmode.png" width="300" alt="cognitiveclass.ai logo">
</center>

<h1 align=center><font size = 5>Assignment: Notebook for Graded Assessment</font></h1>

# Introduction

Using this Python notebook you will:

1.  Understand three Chicago datasets
2.  Load the three datasets into three tables in a SQLIte database
3.  Execute SQL queries to answer assignment questions

## Understand the datasets

To complete the assignment problems in this notebook you will be using three datasets that are available on the city of Chicago's Data Portal:

1.  <a href="https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Socioeconomic Indicators in Chicago</a>
2.  <a href="https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Chicago Public Schools</a>
3.  <a href="https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Chicago Crime Data</a>

### 1. Socioeconomic Indicators in Chicago

This dataset contains a selection of six socioeconomic indicators of public health significance and a “hardship index,” for each Chicago community area, for the years 2008 – 2012.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:

[https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2](https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### 2. Chicago Public Schools

This dataset shows all school level performance data used to create CPS School Report Cards for the 2011-2012 school year. This dataset is provided by the city of Chicago's Data Portal.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:

[https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### 3. Chicago Crime Data

This dataset reflects reported incidents of crime (with the exception of murders where data exists for each victim) that occurred in the City of Chicago from 2001 to present, minus the most recent seven days.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:

[https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2](https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### Download the datasets

This assignment requires you to have these three tables populated with a subset of the whole datasets.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. 

Use the links below to read the data files using the Pandas library. 

* Chicago Census Data

https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01

* Chicago Public Schools

https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01

* Chicago Crime Data

https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCrimeData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01

**NOTE:** Ensure you use the datasets available on the links above instead of directly from the Chicago Data Portal. The versions linked here are subsets of the original datasets and have some of the column names modified to be more database friendly which will make it easier to complete this assignment.

Execute the below code cell to install the required libraries

In [1]:
#!pip install pandas
#!pip install ipython-sql prettytable

import prettytable

prettytable.DEFAULT = 'DEFAULT'

### Store the datasets in database tables

To analyze the data using SQL, it first needs to be loaded into SQLite DB.
We will create three tables in as under:

1.  **CENSUS_DATA**
2.  **CHICAGO_PUBLIC_SCHOOLS**
3.  **CHICAGO_CRIME_DATA**

Load the `pandas` and `sqlite3` libraries and establish a connection to `FinalDB.db`

In [2]:
# Import the pandas library for working with dataframes
import pandas as pd
# Import the sqlite3 library to interact with the SQLite database
import sqlite3

# Create a connection to the SQLite database named 'FinalDB.db'
# If the database file does not exist, it will be created automatically
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

Load the SQL magic module

In [3]:
# Load the SQL magic extension for Jupyter Notebook
# This allows you to run SQL commands directly in notebook cells using %sql or %%sql
%load_ext sql

Use `Pandas` to load the data available in the links above to dataframes. Use these dataframes to load data on to the database `FinalDB.db` as required tables.

In [4]:
# Storing links in variables
census_url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01"
schools_url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01"
crime_url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCrimeData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01"

# Load the datasets from the given URLs into a pandas DataFrames
df_census = pd.read_csv(census_url)
df_schools = pd.read_csv(schools_url)
df_crime = pd.read_csv(crime_url)

# Write the DataFrames to the database as a table
# If the table already exists, it will be replaced
df_census.to_sql("CENSUS_DATA", con=conn, if_exists="replace", index=False)
df_schools.to_sql("CHICAGO_PUBLIC_SCHOOLS", con=conn, if_exists="replace", index=False)
df_crime.to_sql("CHICAGO_CRIME_DATA", con=conn, if_exists="replace", index=False)

533

Establish a connection between SQL magic module and the database `FinalDB.db`

In [5]:
# Connect to the SQLite database 'FinalDB.db' using SQL magic
# This enables executing SQL queries on this database directly in notebook cells
%sql sqlite:///FinalDB.db

You can now proceed to the the following questions. Please note that a graded assignment will follow this lab and there will be a question on each of the problems stated below. It can be from the answer you received or the code you write for this problem. Therefore, please keep a note of both your codes as well as the response you generate.

## Problems

Now write and execute SQL queries to solve assignment problems

### Problem 1

##### Find the total number of crimes recorded in the CRIME table.

In [6]:
%sql select count(*) as total_crimes from CHICAGO_CRIME_DATA;

 * sqlite:///FinalDB.db
Done.

[(533,)]

In [7]:
# Define the query
query = """select count(*) as total_crimes from CHICAGO_CRIME_DATA"""

# Execute the query
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
total_crime_df = pd.DataFrame(rows, columns=column_names)
display(total_crime_df)

   total_crimes
0           533

### Problem 2

##### List community area names and numbers with per capita income less than 11000.

In [8]:
%%sql
select
    COMMUNITY_AREA_NAME,
    COMMUNITY_AREA_NUMBER,
    PER_CAPITA_INCOME
from
    CENSUS_DATA
where PER_CAPITA_INCOME < 11000;

 * sqlite:///FinalDB.db
Done.

[('West Garfield Park', 26.0, 10934),
 ('South Lawndale', 30.0, 10402),
 ('Fuller Park', 37.0, 10432),
 ('Riverdale', 54.0, 8201)]

In [9]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select
    COMMUNITY_AREA_NAME,
    COMMUNITY_AREA_NUMBER,
    PER_CAPITA_INCOME
from
    CENSUS_DATA
where PER_CAPITA_INCOME < 11000;
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
income = pd.DataFrame(rows, columns=column_names)
display(income)

  COMMUNITY_AREA_NAME  COMMUNITY_AREA_NUMBER  PER_CAPITA_INCOME
0  West Garfield Park                   26.0              10934
1      South Lawndale                   30.0              10402
2         Fuller Park                   37.0              10432
3           Riverdale                   54.0               8201

### Problem 3

##### List all case numbers for crimes involving minors?(children are not considered minors for the purposes of crime analysis)

In [10]:
%%sql
select
    CASE_NUMBER as crime_case_number,
    PRIMARY_TYPE as crime_type,
    DESCRIPTION as crime_description
from
    CHICAGO_CRIME_DATA
where DESCRIPTION like '%MINOR%';

 * sqlite:///FinalDB.db
Done.

[('HL266884', 'LIQUOR LAW VIOLATION', 'SELL/GIVE/DEL LIQUOR TO MINOR'),
 ('HK238408', 'LIQUOR LAW VIOLATION', 'ILLEGAL CONSUMPTION BY MINOR')]

In [11]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select
    CASE_NUMBER as crime_case_number,
    PRIMARY_TYPE as crime_type,
    DESCRIPTION as crime_description
from
    CHICAGO_CRIME_DATA
where
    DESCRIPTION like '%MINOR%';
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
minor_df = pd.DataFrame(rows, columns=column_names)
display(minor_df)

  crime_case_number            crime_type              crime_description
0          HL266884  LIQUOR LAW VIOLATION  SELL/GIVE/DEL LIQUOR TO MINOR
1          HK238408  LIQUOR LAW VIOLATION   ILLEGAL CONSUMPTION BY MINOR

### Problem 4

##### List all kidnapping crimes involving a child?

In [12]:
%%sql
select
    CASE_NUMBER as crime_case_number,
    PRIMARY_TYPE as crime_type,
    DESCRIPTION as crime_description
from
    CHICAGO_CRIME_DATA
where PRIMARY_TYPE = 'KIDNAPPING' and DESCRIPTION like '%CHILD%';

 * sqlite:///FinalDB.db
Done.

[('HN144152', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER')]

In [13]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select
    CASE_NUMBER as crime_case_number,
    PRIMARY_TYPE as crime_type,
    DESCRIPTION as crime_description
from
    CHICAGO_CRIME_DATA
where PRIMARY_TYPE = 'KIDNAPPING' and DESCRIPTION like '%CHILD%';
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
kidnapping_df = pd.DataFrame(rows, columns=column_names)
display(kidnapping_df)

  crime_case_number  crime_type         crime_description
0          HN144152  KIDNAPPING  CHILD ABDUCTION/STRANGER

### Problem 5

##### List the kind of crimes that were recorded at schools. (No repetitions)

In [14]:
%%sql
select distinct
    PRIMARY_TYPE as crime_type,
    LOCATION_DESCRIPTION as crime_location
from CHICAGO_CRIME_DATA
where LOCATION_DESCRIPTION like '%SCHOOL%';

 * sqlite:///FinalDB.db
Done.

[('BATTERY', 'SCHOOL, PUBLIC, GROUNDS'),
 ('BATTERY', 'SCHOOL, PUBLIC, BUILDING'),
 ('CRIMINAL DAMAGE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, BUILDING'),
 ('ASSAULT', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL TRESPASS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PRIVATE, BUILDING'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PUBLIC, BUILDING')]

In [15]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select distinct
    PRIMARY_TYPE as crime_type,
    LOCATION_DESCRIPTION as crime_location
from CHICAGO_CRIME_DATA
where LOCATION_DESCRIPTION like '%SCHOOL%';
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
crime_at_school = pd.DataFrame(rows, columns=column_names)
display(crime_at_school)

               crime_type             crime_location
0                 BATTERY    SCHOOL, PUBLIC, GROUNDS
1                 BATTERY   SCHOOL, PUBLIC, BUILDING
2         CRIMINAL DAMAGE    SCHOOL, PUBLIC, GROUNDS
3               NARCOTICS    SCHOOL, PUBLIC, GROUNDS
4               NARCOTICS   SCHOOL, PUBLIC, BUILDING
5                 ASSAULT    SCHOOL, PUBLIC, GROUNDS
6       CRIMINAL TRESPASS    SCHOOL, PUBLIC, GROUNDS
7  PUBLIC PEACE VIOLATION  SCHOOL, PRIVATE, BUILDING
8  PUBLIC PEACE VIOLATION   SCHOOL, PUBLIC, BUILDING

### Problem 6

##### List the type of schools along with the average safety score for each type.

In [16]:
%%sql
select
    "Elementary, Middle, or High School" as type_of_schools,
    avg(SAFETY_SCORE) as avg_safety_score
from CHICAGO_PUBLIC_SCHOOLS
group by type_of_schools
order by avg_safety_score desc;

 * sqlite:///FinalDB.db
Done.

[('HS', 49.62352941176471), ('ES', 49.52038369304557), ('MS', 48.0)]

In [17]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select
    "Elementary, Middle, or High School" as type_of_schools,
    avg(SAFETY_SCORE) as avg_safety_score
from CHICAGO_PUBLIC_SCHOOLS
group by type_of_schools
order by avg_safety_score desc;
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
type_of_schools_df = pd.DataFrame(rows, columns=column_names)
display(type_of_schools_df)

  type_of_schools  avg_safety_score
0              HS         49.623529
1              ES         49.520384
2              MS         48.000000

### Problem 7

##### List 5 community areas with highest % of households below poverty line

In [18]:
%%sql
select
    COMMUNITY_AREA_NUMBER as community_area_number,
    COMMUNITY_AREA_NAME as community_area_name,
    PERCENT_HOUSEHOLDS_BELOW_POVERTY as percent_households_below_poverty
from CENSUS_DATA
order by percent_households_below_poverty desc
limit 5;

 * sqlite:///FinalDB.db
Done.

[(54.0, 'Riverdale', 56.5),
 (37.0, 'Fuller Park', 51.2),
 (68.0, 'Englewood', 46.6),
 (29.0, 'North Lawndale', 43.1),
 (27.0, 'East Garfield Park', 42.4)]

In [32]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select
    COMMUNITY_AREA_NUMBER as community_area_number,
    COMMUNITY_AREA_NAME as community_area_name,
    PERCENT_HOUSEHOLDS_BELOW_POVERTY as percent_households_below_poverty
from CENSUS_DATA
order by percent_households_below_poverty desc
limit 5;
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
below_poverty_line_df = pd.DataFrame(rows, columns=column_names)
display(below_poverty_line_df)

   community_area_number community_area_name  percent_households_below_poverty
0                   54.0           Riverdale                              56.5
1                   37.0         Fuller Park                              51.2
2                   68.0           Englewood                              46.6
3                   29.0      North Lawndale                              43.1
4                   27.0  East Garfield Park                              42.4

### Problem 8

##### Which community area is most crime prone? Display the coumminty area number only.

In [34]:
%%sql
select
    COMMUNITY_AREA_NUMBER,
    count(*) as total_crimes
from CHICAGO_CRIME_DATA
group by COMMUNITY_AREA_NUMBER
order by total_crimes desc
limit 1;

 * sqlite:///FinalDB.db
Done.

[(25.0, 43)]

In [35]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select
    COMMUNITY_AREA_NUMBER,
    count(*) as total_crimes
from CHICAGO_CRIME_DATA
group by COMMUNITY_AREA_NUMBER
order by total_crimes desc
limit 1;
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
total_crimes_df = pd.DataFrame(rows, columns=column_names)
display(total_crimes_df)

   COMMUNITY_AREA_NUMBER  total_crimes
0                   25.0            43


Double-click **here** for a hint

<!--
Query for the 'community area number' that has most number of incidents
-->

### Problem 9

##### Use a sub-query to find the name of the community area with highest hardship index

In [40]:
%%sql
select COMMUNITY_AREA_NAME as community_area_name
from CENSUS_DATA
where HARDSHIP_INDEX = (
    select max(HARDSHIP_INDEX)
    from CENSUS_DATA
);

 * sqlite:///FinalDB.db
Done.

[('Riverdale',)]

In [45]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select COMMUNITY_AREA_NAME as community_area_name
from CENSUS_DATA
where HARDSHIP_INDEX = (
    select max(HARDSHIP_INDEX)
    from CENSUS_DATA
);
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
highest_hardship_df = pd.DataFrame(rows, columns=column_names)
display(highest_hardship_df)

  community_area_name
0           Riverdale

### Problem 10

##### Use a sub-query to determine the Community Area Name with most number of crimes?

In [ ]:
%%sql
select COMMUNITY_AREA_NAME
from CENSUS_DATA 
where COMMUNITY_AREA_NUMBER  = (
    select COMMUNITY_AREA_NUMBER
    from CHICAGO_CRIME_DATA
    group by COMMUNITY_AREA_NUMBER
    order by count(*) desc
);

 * sqlite:///FinalDB.db
Done.

[('Austin',)]

In [50]:
# Re-establish the connection if it was closed
conn = sqlite3.connect("FinalDB.db")
cursor = conn.cursor()

# Define and execute the query
query = """
select COMMUNITY_AREA_NAME
from CENSUS_DATA 
where COMMUNITY_AREA_NUMBER  = (
    select COMMUNITY_AREA_NUMBER
    from CHICAGO_CRIME_DATA
    group by COMMUNITY_AREA_NUMBER
    order by count(*) desc
);
"""

# Fetch results and column names
cursor.execute(query)
rows = cursor.fetchall()

# Extract column names from cursor metadata
column_names = [description[0] for description in cursor.description]

# Create a DataFrame for clean display
highest_crimes_df = pd.DataFrame(rows, columns=column_names)
display(highest_crimes_df)

  COMMUNITY_AREA_NAME
0              Austin

In [ ]:
# Close the connection of the FinalDB.db
conn.close()
cursor.close()

## Author(s)

<h4> Hima Vasudevan </h4>
<h4> Rav Ahuja </h4>
<h4> Ramesh Sannreddy </h4>

## Contribtuor(s)

<h4> Malika Singla </h4>
<h4>Abhishek Gagneja</h4>
<!--
## Change log

| Date       | Version | Changed by        | Change Description                             |
| ---------- | ------- | ----------------- | ---------------------------------------------- |
|2023-10-18  | 2.6     | Abhishek Gagneja  | Modified instruction set |
| 2022-03-04 | 2.5     | Lakshmi Holla     | Changed markdown.                   |
| 2021-05-19 | 2.4     | Lakshmi Holla     | Updated the question                           |
| 2021-04-30 | 2.3     | Malika Singla     | Updated the libraries                          |
| 2021-01-15 | 2.2     | Rav Ahuja         | Removed problem 11 and fixed changelog         |
| 2020-11-25 | 2.1     | Ramesh Sannareddy | Updated the problem statements, and datasets   |
| 2020-09-05 | 2.0     | Malika Singla     | Moved lab to course repo in GitLab             |
| 2018-07-18 | 1.0     | Rav Ahuja         | Several updates including loading instructions |
| 2018-05-04 | 0.1     | Hima Vasudevan    | Created initial version                        |
-->
## <h3 align="center"> © IBM Corporation 2023. All rights reserved. <h3/>